
Network Working Group                                         Enke Chen
Internet Draft                                         Redback Networks
Expiration Date: October 2004                            Vincent Gillet
                                                         France Telecom

              Subcodes for BGP Cease Notification Message

                  draft-ietf-idr-cease-subcode-05.txt


1. Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as ``work in progress.''

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.


2. Abstract

   This document defines several subcodes for the BGP Cease NOTIFICATION
   message that would provide more information to aid network operators
   in co-relating network events and diagnosing BGP peering issues.














Chen & Gillet                                                   [Page 1]





Internet Draft     draft-ietf-idr-cease-subcode-05.txt        March 2004


3. Specification of Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC-2119].


4. Introduction

   This document defines several subcodes for the BGP Cease NOTIFICATION
   message that would provide more information to aid network operators
   in co-relating network events and diagnosing BGP peering issues.


5. Subcode Definition

   The following subcodes are defined for the Cease NOTIFICATION
   message:

      Subcode     Symbolic Name

         1        Maximum Number of Prefixes Reached
         2        Administrative Shutdown
         3        Peer Unconfigured
         4        Administrative Reset
         5        Connection Rejected
         6        Other Configuration Change
         7        Connection Collision Resolution
         8        Out of Resource


6. Subcode Usage

   If a BGP speaker decides to terminate its peering with a neighbor
   because the number of address prefixes received from the neighbor
   exceeds a locally configured upper bound (as described in [BGP-4]),
   then the speaker MUST send to the neighbor a NOTIFICATION message
   with the Error Code Cease, and the Error Subcode "Maximum Number of
   Prefixes Reached". The message MAY optionally include the Address
   Family information [BGP-MP] and the upper bound in the "Data" field
   with the following format:

                  +-------------------------------+
                  | AFI (2 octets)                |
                  +-------------------------------+
                  | SAFI (1 octet)                |
                  +-------------------------------+
                  | Prefix upper bound (4 octets) |



Chen & Gillet                                                   [Page 2]





Internet Draft     draft-ietf-idr-cease-subcode-05.txt        March 2004


                  +-------------------------------+

   where the meaning and use of the <AFI, SAFI> tuple is the same as
   defined in [BGP-MP, sect. 7].

   If a BGP speaker decides to administratively shut down its peering
   with a neighbor, then the speaker SHOULD send a NOTIFICATION message
   with the Error Code Cease, and the Error Subcode "Administrative
   Shutdown".

   If a BGP speaker decides to unconfigure a peer, then the speaker
   SHOULD send a NOTIFICATION message with the Error Code Cease, and the
   Error Subcode "Peer Unconfigured".

   If a BGP speaker decides to administratively reset the peering with a
   neighbor, then the speaker SHOULD send a NOTIFICATION message with
   the Error Code Cease, and the Error Subcode "Administrative Reset".

   If a BGP speaker decides to dis-allow a BGP connection (e.g., the
   peer is not configured locally) after the speaker accepts a transport
   protocol connection, then the BGP speaker SHOULD send a NOTIFICATION
   message with the Error Code Cease, and the Error Subcode "Connection
   Rejected".

   If a BGP speaker decides to administratively reset the peering with a
   neighbor due to a configuration change other than the ones described
   above, then the speaker SHOULD send a NOTIFICATION message with the
   Error Code Cease, and the Error Subcode "Other Configuration Change".

   If a BGP speaker decides to send a NOTIFICATION message with the
   Error Code Cease as a result of the collision resolution procedure
   (as described in [BGP-4]), then the subcode SHOULD be set to
   "Connection Collision Resolution".

   If a BGP speaker runs out of resource (e.g., memory) and decides to
   reset a session, then the speaker MAY send a NOTIFICATION message
   with the Error Code Cease, and the Error Subcode "Out of Resource".

   It is RECOMMENDED that a BGP speaker implement a backoff mechanism in
   re-trying a BGP connection after the speaker receives a Cease
   NOTIFICATION message with subcode of "Administrative Shutdown", or
   "Peer Unconfigured", or "Connection Rejected", or "Out of Resource".
   An implementation MAY impose an upper bound on the number of
   consecutive automatic retries. Once this bound is reached, the
   implementation would stop re-trying any BGP connections until some
   administrative intervention.





Chen & Gillet                                                   [Page 3]





Internet Draft     draft-ietf-idr-cease-subcode-05.txt        March 2004


7. IANA Considerations

   This document defines several subcodes for the BGP Cease NOTIFICATION
   messsage.  New subcodes MUST only be introduced using the Standards
   Action process defined in [RFC-2434].


8. Security Considerations

   This extension to BGP does not change the underlying security issues
   inherent in the existing BGP.


9. Acknowledgments

   The authors would like to thank Yakov Rekhter, Pedro Marques, Andrew
   Lange and Don Goodspeed for their review and suggestions.


10. References

   [BGP-4] Y. Rekhter, T. Li and S. Hares, "A Border Gateway Protocol 4
   (BGP-4)", <draft-ietf-idr-bgp4-23.txt>, November 2003.

   [BGP-MP] Bates, T., Chandra, R., Katz, D. and Y. Rekhter,
   "Multiprotocol Extensions for BGP-4", RFC 2858, June 2000.

   [RFC-2434] Narten, T., Alvestrand, H., "Guidelines for Writing an
   IANA Considerations Section in RFCs", RFC 2434, October 1998.

   [RFC-2119] Bradner, S., "Key words for use in RFCs to Indicate
   Requirement Levels", BCP 14, RFC 2119, March 1997.


11. Author Information


   Enke Chen
   Redback Networks, Inc.
   300 Holger Way
   San Jose, CA 95134
   Email: enke@redback.com

   Vincent Gillet
   France Telecom Longues Distances
   246 rue de Bercy
   75594 Paris Cedex 12 FRANCE
   Email: vgi@opentransit.net



Chen & Gillet                                                   [Page 4]





Internet Draft     draft-ietf-idr-cease-subcode-05.txt        March 2004





















































Chen & Gillet                                                   [Page 5]

